balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16F1783.PIC
        <edc:AdjustPoint edc:offset="5"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONA" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONA0" edc:desc="" edc:mask="0x1" edc:name="SLRCONA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA1" edc:desc="" edc:mask="0x1" edc:name="SLRCONA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA2" edc:desc="" edc:mask="0x1" edc:name="SLRCONA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA3" edc:desc="" edc:mask="0x1" edc:name="SLRCONA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA4" edc:desc="" edc:mask="0x1" edc:name="SLRCONA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA5" edc:desc="" edc:mask="0x1" edc:name="SLRCONA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA6" edc:desc="" edc:mask="0x1" edc:name="SLRCONA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONA7" edc:desc="" edc:mask="0x1" edc:name="SLRCONA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONA" edc:desc="" edc:mask="0xff" edc:name="SLRCONA" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONB" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONB0" edc:desc="" edc:mask="0x1" edc:name="SLRCONB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB1" edc:desc="" edc:mask="0x1" edc:name="SLRCONB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB2" edc:desc="" edc:mask="0x1" edc:name="SLRCONB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB3" edc:desc="" edc:mask="0x1" edc:name="SLRCONB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB4" edc:desc="" edc:mask="0x1" edc:name="SLRCONB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB5" edc:desc="" edc:mask="0x1" edc:name="SLRCONB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB6" edc:desc="" edc:mask="0x1" edc:name="SLRCONB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONB7" edc:desc="" edc:mask="0x1" edc:name="SLRCONB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONB" edc:desc="" edc:mask="0xff" edc:name="SLRCONB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SLRCONC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SLRCONC" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SLRCONC0" edc:desc="" edc:mask="0x1" edc:name="SLRCONC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC1" edc:desc="" edc:mask="0x1" edc:name="SLRCONC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC2" edc:desc="" edc:mask="0x1" edc:name="SLRCONC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC3" edc:desc="" edc:mask="0x1" edc:name="SLRCONC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC4" edc:desc="" edc:mask="0x1" edc:name="SLRCONC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC5" edc:desc="" edc:mask="0x1" edc:name="SLRCONC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC6" edc:desc="" edc:mask="0x1" edc:name="SLRCONC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SLRCONC7" edc:desc="" edc:mask="0x1" edc:name="SLRCONC7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SLRCONC" edc:desc="" edc:mask="0xff" edc:name="SLRCONC" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="17"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="INLVLA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="INLVLA" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INLVLA0" edc:desc="" edc:mask="0x1" edc:name="INLVLA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA1" edc:desc="" edc:mask="0x1" edc:name="INLVLA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA2" edc:desc="" edc:mask="0x1" edc:name="INLVLA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA3" edc:desc="" edc:mask="0x1" edc:name="INLVLA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA4" edc:desc="" edc:mask="0x1" edc:name="INLVLA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA5" edc:desc="" edc:mask="0x1" edc:name="INLVLA5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA6" edc:desc="" edc:mask="0x1" edc:name="INLVLA6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INLVLA7" edc:desc="" edc:mask="0x1" edc:name="INLVLA7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INLVLA" edc:desc="" edc:mask="0xff" edc:name="INLVLA" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
